app/Models/model_sub_kategori.php

    public function total_sub_kategori()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_sub_kategori) as total_sub_kategori')
            ->get();
---
SELECT COUNT(DISTINCT id_sub_kategori) as total_sub_kategori
FROM `sub_kategori`