app/Models/model_petugas.php

SELECT COUNT(DISTINCT id_role) as total_petugas
FROM `petugas`
WHERE `role` = 'petugas'
---
    public function total_petugas()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_role) as total_petugas')
            ->where('role', 'petugas')
            ->get();

SELECT COUNT(DISTINCT id_role) as total_admin
FROM `petugas`
WHERE `role` = 'admin'
---
    public function total_admin()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_role) as total_admin')
            ->where('role', 'admin')
            ->get();