app/Models/modelpeminjaman.php

SELECT COUNT(DISTINCT peminjaman_id) as total_peminjaman
FROM `peminjaman`
WHERE DATE_FORMAT(tanggal_peminjaman, '%m') = '10'
AND `status_peminjaman` = 'di-pinjam'
---
    public function total_peminjaman()
    {
        $currentMonth = date('m'); // Mendapatkan bulan saat ini

        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT peminjaman_id) as total_peminjaman')
            ->where("DATE_FORMAT(tanggal_peminjaman, '%m')", $currentMonth)
            ->where('status_peminjaman', 'di-pinjam')
            ->get();