app/Models/modelkoleksibuku.php

SELECT *
FROM `koleksi_pribadi`
JOIN `user` ON `user`.`user_id` = `koleksi_pribadi`.`user_id`
JOIN `buku` ON `buku`.`buku_id` = `koleksi_pribadi`.`buku_id`
JOIN `kategoribuku` ON `kategoribuku`.`kategori_id` = `buku`.`kategori_id`
WHERE `koleksi_pribadi`.`user_id` IS NULL
---
     public function semua_koleksi_by_member($user_id)
     {
         $query = $this->db->table('koleksi_pribadi');
         $result = $query->select('*')
             ->join('user', 'user.user_id = koleksi_pribadi.user_id')
             ->join('buku', 'buku.buku_id = koleksi_pribadi.buku_id')
             ->join('kategoribuku', 'kategoribuku.kategori_id = buku.kategori_id')
             ->where('koleksi_pribadi.user_id', $user_id)
             ->get()
             ->getResultArray();