app/Models/modelpengembalian.php

    public function total_pengembalian()
    {
        $currentMonth = date('m'); // Mendapatkan bulan saat ini

        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_pengembalian) as total_pengembalian')
            ->where("DATE_FORMAT(tanggal_pengembalian, '%m')", $currentMonth)
            ->get();
---
SELECT COUNT(DISTINCT id_pengembalian) as total_pengembalian
FROM `pengembalian`
WHERE DATE_FORMAT(tanggal_pengembalian, '%m') = '10'