app/Models/model_daftar_buku.php

    public function semua_daftar_buku()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->join('kategoribuku', 'kategoribuku.kategori_id  = '.$this->table.'.kategori_id ', 'left')
            ->join('sub_kategori', 'sub_kategori.id_sub_kategori = '.$this->table.'.id_sub_kategori', 'left')
            ->orderBy('buku_id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `buku`
LEFT JOIN `kategoribuku` ON `kategoribuku`.`kategori_id`  = `buku`.`kategori_id`
LEFT JOIN `sub_kategori` ON `sub_kategori`.`id_sub_kategori` = `buku`.`id_sub_kategori`
ORDER BY `buku_id` ASC